Once pandas are installed, we need to import the library

In [2]:
#Import pandas and numpy
import pandas as pd
import numpy as np

Pandas generally provide two data structure for manipulating data, They are:

$\bullet$ Series-is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The object supports both integer and label-based indexing and provides a host of methods for performing operations involving the index.

$\bullet$ DataFrame-is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).Pandas DataFrame consists of three principal components, the data, rows, and columns.

# Creating a series
We can create a series by using a list, array or dictionary. Let get started by creating an empty series.

In [4]:
# Creating empty series  
ser = pd.Series()
print(ser)

Series([], dtype: float64)

1. Creating a series using a list

In [21]:
#create a series using a list  
lst =[2,3,5,"A",8] 
    
ser = pd.Series(lst)  
print(ser)

0    2
1    3
2    5
3    A
4    8
dtype: object

2. Creating a series using an array

In [25]:
# simple array 
import numpy as np
data = np.array([ "One", "Woman", "In", 'Science'])  
    
ser = pd.Series(data)  
print(ser)

0        One
1      Woman
2         In
3    Science
dtype: object

3. Using a dictionary

We can use the examples above to work out how to use dictionaries to create a series

# Creating a data frame
 Dataframes can be created in different ways. As in the case of series, we can use lists, arrays and dictionaries to create dataframes. 

Let us start by creating an empty dataframe. We use the dataframe constructor **pd.dataframe()** as shown below

In [38]:
#Creating an empty data frame
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

1. Creating dataframes using lists

In [34]:
# creating a list 
lst = [10, 15,45, 2, 1]  
   
# Calling DataFrame constructor on list  
df = pd.DataFrame(lst)  
print(df)

    0
0  10
1  15
2  45
3   2
4   1

We can add a column name to the dataframe by specifying the name inside the dataframe constructor

In [36]:
df = pd.DataFrame(lst,columns=["Marks"])  
df

   Marks
0     10
1     15
2     45
3      2
4      1

2. Creating a dataframe using dictionaries

In [41]:
# DataFrame from dict narray

# intialise data of lists.
data = {'Name':['Mary', 'Susan', 'Sarah', 'Hellen'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame using the constructo
df = pd.DataFrame(data)
 
# Print the dataframe.
print(df)

     Name  Age
0    Mary   20
1   Susan   21
2   Sarah   19
3  Hellen   18

We can also try to check out how we can create dataframes using other methods. 

Now let us see how we can deal with the rows and columns of a dataframe

# Dealing with rows and columns
We can perform basic operations on rows/columns like selecting, deleting, adding, and renaming values in the dataframe. Let us create a dataframe to illustrate this.

In [31]:
# Define a dictionary containing employee data
data = {'Name':['Mary', 'Susan', "Sarah", 'Hellen'],
        'Age':[27, np.NaN, 22, 32],
        'Country':['SA', 'KE', 'GH', 'TZ'],
        'Qualification':['Msc', 'MA', 'MA', 'Phd']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
#View the entire data frame
#print(df)
df

     Name   Age Country Qualification
0    Mary  27.0      SA           Msc
1   Susan   NaN      KE            MA
2   Sarah  22.0      GH            MA
3  Hellen  32.0      TZ           Phd

# Selecting

1. Column Selection: 

In order to select a column in Pandas DataFrame, we can either access the columns by calling them by their columns name. We simply put the name of the column in-between the brackets

In [32]:
 # select two columns
df["Name"]

0      Mary
1     Susan
2     Sarah
3    Hellen
Name: Name, dtype: object

To return the column name, using double square brackets

In [33]:
df[["Name"]]

     Name
0    Mary
1   Susan
2   Sarah
3  Hellen

We can select more than one column

In [34]:
df[['Name', 'Country',"Qualification"]]

     Name Country Qualification
0    Mary      SA           Msc
1   Susan      KE            MA
2   Sarah      GH            MA
3  Hellen      TZ           Phd

2. Row Selection: 

Pandas provide a unique method to retrieve rows from a Data frame.The  **.loc[ ]**  method is used to retrieve rows from Pandas dataframe. This is done passing integer location to the **loc[ ]** function of specifying the column name and specific condition to be met

In [35]:
#Specifying the index of the row
df.loc[[1]]

    Name  Age Country Qualification
1  Susan  NaN      KE            MA

In [36]:
# retrieving row by loc method using a condition
df.loc[df['Name'] == 'Mary']

   Name   Age Country Qualification
0  Mary  27.0      SA           Msc

# Renaming
We can rename columns in a dataframe

In [37]:
df.rename(columns={'Name':'Surname'}, inplace=True)
df

  Surname   Age Country Qualification
0    Mary  27.0      SA           Msc
1   Susan   NaN      KE            MA
2   Sarah  22.0      GH            MA
3  Hellen  32.0      TZ           Phd

We can rename all columns as

In [38]:
df.columns=["Names","Old","Origin","Qual"]
df

    Names   Old Origin Qual
0    Mary  27.0     SA  Msc
1   Susan   NaN     KE   MA
2   Sarah  22.0     GH   MA
3  Hellen  32.0     TZ  Phd

# Missing Values
To check for missing values in the dataframe, we use the using **isnull()** function

In [39]:
df.isnull()

   Names    Old  Origin   Qual
0  False  False   False  False
1  False   True   False  False
2  False  False   False  False
3  False  False   False  False

We can check the total number of missing values in the dataframe by summing all the missing values

In [116]:
df.isnull().sum()

Name             0
Age              1
Country          0
Qualification    0
dtype: int64

We can replace the missing values with a different value using using **fillna( )**

In [123]:
df.fillna(0,inplace=True)
df

     Name   Age Country Qualification
0    Mary  27.0      SA           Msc
1   Susan   0.0      KE            MA
2   Sarah  22.0      GH            MA
3  Hellen  32.0      TZ           Phd

We can also drop the columns or rows that has missing values. We specify axis(0) for rows and axis(1) for columns

In [130]:
df.dropna(axis=0)

     Name   Age Country Qualification
0    Mary  27.0      SA           Msc
2   Sarah  22.0      GH            MA
3  Hellen  32.0      TZ           Phd

# Reading data into pandas

We can import data using the read command as follows

In [138]:
# Load the Pandas libraries with alias 'pd' 
import pandas as pd 
# Read data from file 'filename.csv' depending on the file extension 
dataset=pd.read_csv('sales.csv')
#dataset

We can decide to view the first few rows of the data or the last few rows using the head or tail command

In [132]:
# Preview the first 5 lines of the loaded data 
dataset.head()

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
0,1/2/09 6:17,Product1,1200,Mastercard,carolina,Basildon,England,United Kingdom,1/2/09 6:00,1/2/09 6:08,51.500000,-1.116667
1,1/2/09 4:53,Product1,1200,Visa,Betina,Parkville,MO,United States,1/2/09 4:42,1/2/09 7:49,39.195000,-94.681940
2,1/2/09 13:08,Product1,1200,Mastercard,Federica e Andrea,Astoria,OR,United States,1/1/09 16:21,1/3/09 12:32,46.188060,-123.830000
3,1/3/09 14:44,Product1,1200,Visa,Gouya,Echuca,Victoria,Australia,9/25/05 21:13,1/3/09 14:22,-36.133333,144.750000
4,1/4/09 12:56,Product2,3600,Visa,Gerd W,Cahaba Heights,AL,United States,11/15/08 15:47,1/4/09 12:45,33.520560,-86.802500

In [134]:
# Preview the first 5 lines of the loaded data 
#dataset.tail()

In [167]:
#We specify the number of rows we need to display
dataset.head(2)

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
0,1/2/09 6:17,Product1,1200,Mastercard,carolina,Basildon,England,United Kingdom,1/2/09 6:00,1/2/09 6:08,51.500,-1.116667
1,1/2/09 4:53,Product1,1200,Visa,Betina,Parkville,MO,United States,1/2/09 4:42,1/2/09 7:49,39.195,-94.681940

**Checking the shape, size and dimension of the data**

In [174]:
#Shape of the data-gives total rows and columns
dataset.shape

(998, 12)

In [171]:
#The total number of elements in the dataset-gives rows x columns
dataset.size

11976

In [175]:
#Dimension
dataset.ndim

2

In [197]:
###  unique values in categorical variables
unique = dataset.select_dtypes('object').apply(pd.Series.nunique, axis = 0)
#unique

# Indexing and subsetting

1. Using loc function. 

The loc indexer is used with the same syntax as iloc: data.loc[row selection, column selection]. It can be done in two ways

         a.) Selecting rows by label/index

In [150]:
dataset.set_index("Transaction_date", inplace=False)
dataset.loc[0:3]

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
0,1/2/09 6:17,Product1,1200,Mastercard,carolina,Basildon,England,United Kingdom,1/2/09 6:00,1/2/09 6:08,51.500000,-1.116667
1,1/2/09 4:53,Product1,1200,Visa,Betina,Parkville,MO,United States,1/2/09 4:42,1/2/09 7:49,39.195000,-94.681940
2,1/2/09 13:08,Product1,1200,Mastercard,Federica e Andrea,Astoria,OR,United States,1/1/09 16:21,1/3/09 12:32,46.188060,-123.830000
3,1/3/09 14:44,Product1,1200,Visa,Gouya,Echuca,Victoria,Australia,9/25/05 21:13,1/3/09 14:22,-36.133333,144.750000

          b.) Selecting rows with a boolean / conditional lookup

2.  Using iloc function

The iloc indexer syntax is data.iloc[row selection, column selection]. **“iloc”** in pandas is used to select rows and columns by number, in the order that they appear in the data frame.

In [5]:
dataset.iloc[0:2,1:3]

    Product Price
0  Product1  1200
1  Product1  1200

3. Using ix and iloc function. 

The ix\[ \] indexer is a hybrid of **.loc** and **.iloc.**  Find time and check out this type of indexing.

# Checking for missing values in our dataset

In [ ]:
#Checking the total number of missing values 
dataset.isna().sum()

Filling in the missing values in the dataset

In [160]:
#Fill missing values using the forward method
new_data=dataset.fillna(axis=1, method="ffill")
#new_data
#We can now check whether we have missing values
new_data.isnull().sum()

Transaction_date    0
Product             0
Price               0
Payment_Type        0
Name                0
City                0
State               0
Country             0
Account_Created     0
Last_Login          0
Latitude            0
Longitude           0
dtype: int64

In [177]:
new_data.describe(include="all")

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude
count,998,998,998,998,998,998,998,998,998,998,998.00000,998.00000
unique,987,4,9,4,765,759,205,56,976,977,706.00000,723.00000
top,1/10/09 8:13,Product1,1200,Visa,Sarah,London,England,United States,1/17/09 7:25,2/26/09 7:32,51.52721,0.14559
freq,2,847,841,522,11,19,86,463,3,3,14.00000,14.00000

# Exercise
1. Create a dataframe with the following exam details: 

exam_data = {'name': ['Mary', 'Tim', 'Kate', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Susan', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],

'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10']

**Questions**
1. Create a dataframe from the above given data

In [190]:
import pandas as pd
import numpy as np

exam_data  = {'Name': ['Mary', 'Tim', 'Kate', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Susan', 'Jonas'],
        'Score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'Attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'Qualified': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10']

Data_Ex = pd.DataFrame(exam_data , index=labels)
#print(Data_Ex)

2. Find the summary scores of the students

In [ ]:
#Data_Ex["Score"].describe()

3. How many missing values are there in the dataframe? Which variables have missing values?

In [186]:
#Data_Ex.isna().sum()

4. Replace the missing values with the mean

In [221]:
#Data_Ex1=Data_Ex.fillna(np.mean(Data_Ex["Score"]))

5. Give a list of the students who Qualified

In [210]:
Qualified=Data_Ex[Data_Ex["Qualified"]=='yes']
Qualified

       Name  Score  Attempts Qualified
1      Mary   12.5         1       yes
3      Kate   16.5         2       yes
6   Michael   20.0         3       yes
7   Matthew   14.5         1       yes
10    Jonas   19.0         1       yes

6. Rank the students from the one with the highest to the lowest score

In [228]:
#Data_Ex1["Rank"]=Data_Ex1["Score"].rank()
#Data_Ex1

In [229]:
Data_Ex1.sort_values(by=['Score'], ascending=False)

       Name    Score  Attempts Qualified  Rank
6   Michael  20.0000         3       yes  10.0
10    Jonas  19.0000         1       yes   9.0
3      Kate  16.5000         2       yes   8.0
7   Matthew  14.5000         1       yes   7.0
4     James  13.5625         3        no   5.5
8     Laura  13.5625         1        no   5.5
1      Mary  12.5000         1       yes   4.0
2       Tim   9.0000         3        no   2.5
5     Emily   9.0000         2        no   2.5
9     Susan   8.0000         2        no   1.0